Tutorials-2.3.0/mixingChanngel-1-Central/constant/reactions
species
(
    H2
    N2
);

reactions
{
}
